In [2]:
import pandas as pd
import requests as rq
from zipfile import ZipFile
from matplotlib import pyplot as plt

## Title, Gross

In [6]:
bom_df = pd.read_csv('data/zippedData/bom.movie_gross.csv.gz')
# bom_df.head(1)

         title studio  domestic_gross foreign_gross  year
0  Toy Story 3     BV     415000000.0     652000000  2010

## Person/Name, known for titles

In [52]:
imdb_name_basics_df = pd.read_csv('data/zippedData/imdb.name.basics.csv.gz')
imdb_name_basics_df.head(1)

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"

## Title AKA

In [53]:
imdb_title_akas_df = pd.read_csv('data/zippedData/imdb.title.akas.csv.gz')
imdb_title_akas_df.head(10)

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0
5,tt0369610,15,Jurassic World,GR,NaN,imdbDisplay,NaN,0.0
6,tt0369610,16,Jurassic World,IT,NaN,imdbDisplay,NaN,0.0
7,tt0369610,17,Jurski svijet,HR,NaN,imdbDisplay,NaN,0.0
8,tt0369610,18,Olam ha'Yura,IL,he,imdbDisplay,NaN,0.0
9,tt0369610,19,Jurassic World: Mundo Jurásico,MX,NaN,imdbDisplay,NaN,0.0

## Title, Genre

In [8]:
imdb_title_basics_df = pd.read_csv('data/zippedData/imdb.title.basics.csv.gz')
imdb_title_basics_df.head(1)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"

## Directors, Writers

In [9]:
imdb_title_crew_df = pd.read_csv('data/zippedData/imdb.title.crew.csv.gz')
imdb_title_crew_df.head(1)

      tconst  directors    writers
0  tt0285252  nm0899854  nm0899854

## Job (actor/actress, Director)

In [49]:
imdb_title_principals_df = pd.read_csv('data/zippedData/imdb.title.principals.csv.gz')
imdb_title_principals_df.head(1)

      tconst  ordering     nconst category  job   characters
0  tt0111414         1  nm0246005    actor  NaN  ["The Man"]

## Avg Rating

In [22]:
imdb_title_ratings_df = pd.read_csv('data/zippedData/imdb.title.ratings.csv.gz')
imdb_title_ratings_df.head(1)

       tconst  averagerating  numvotes
0  tt10356526            8.3        31

## Genre, Synopsis, Director

In [31]:
rt_movie_info_df = pd.read_csv('data/zippedData/rt.movie_info.tsv.gz', error_bad_lines=False, sep='\t')
rt_movie_info_df.head(1)
# rt_movie_info_df.info()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN

## RT Rating, Fresh/Rotten

In [42]:
rt_reviews_df = pd.read_csv('data/zippedData/rt.reviews.tsv.gz', error_bad_lines=False, encoding= 'unicode_escape', sep='\t')
rt_reviews_df.head(1)
# rt_reviews_df.info()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"

## Popularity, Vote Avg, Vote Count

In [44]:
tmdb_movies_df = pd.read_csv('data/zippedData/tmdb.movies.csv.gz')
tmdb_movies_df.head(1)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788

## Budget , Gross

In [170]:
tn_movie_budgets_df = pd.read_csv('data/zippedData/tn.movie_budgets.csv.gz')
tn_movie_budgets_df.head(1)

   id  release_date   movie production_budget domestic_gross worldwide_gross
0   1  Dec 18, 2009  Avatar      $425,000,000   $760,507,625  $2,776,345,279

In [171]:
tn_movie_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [172]:
def drop_dollar_sign(value):
    value_list = list(value)
    value_list.remove('$')
    for char in value_list:
        if ',' == char:
            value_list.remove(char)
    value_float = float(''.join(value_list))
    value = value_float
    return value

def make_money(value):
    value = '${:,.2f}'.format(value)
    return value

tn_movie_budgets_df['dom_prof'] = tn_movie_budgets_df['domestic_gross'].map(drop_dollar_sign) - tn_movie_budgets_df['production_budget'].map(drop_dollar_sign)
tn_movie_budgets_df['ww_prof'] = tn_movie_budgets_df['worldwide_gross'].map(drop_dollar_sign) - tn_movie_budgets_df['production_budget'].map(drop_dollar_sign)

In [179]:
tn_movie_budgets_sorted_df = tn_movie_budgets_df.drop(['id', 'release_date', 'domestic_gross', 'worldwide_gross'], axis=1)
tn_movie_profits_df = tn_movie_budgets_sorted_df.sort_values(by='dom_prof', ascending=False)
tn_movie_profits_df['Domestic Profit'] = tn_movie_budgets_df['dom_prof'].map(make_money)
tn_movie_profits_df['Worldwide Profit'] = tn_movie_budgets_df['ww_prof'].map(make_money)
tn_numbers_str_df = tn_movie_profits_df.set_index('movie').drop (['dom_prof', 'ww_prof'], axis=1)
tn_numbers_floats_df = tn_movie_profits_df.set_index('movie').drop (['Domestic Profit', 'Worldwide Profit'], axis=1)
tn_numbers_str_df.head(20)
# tn_numbers_floats_df.head(20)

,production_budget,Domestic Profit,Worldwide Profit
movie,,,
Star Wars Ep. VII: The Force Awakens,"$306,000,000","$630,662,225.00","$1,747,311,220.00"
Black Panther,"$200,000,000","$500,059,566.00","$1,148,258,224.00"
Titanic,"$200,000,000","$459,363,944.00","$2,008,208,395.00"
Star Wars Ep. IV: A New Hope,"$11,000,000","$449,998,007.00","$775,598,007.00"
Jurassic World,"$215,000,000","$437,270,625.00","$1,433,854,864.00"
ET: The Extra-Terrestrial,"$10,500,000","$424,610,554.00","$782,465,326.00"
Incredibles 2,"$200,000,000","$408,581,744.00","$1,042,520,711.00"
The Avengers,"$225,000,000","$398,279,547.00","$1,292,935,897.00"
Avengers: Infinity War,"$300,000,000","$378,815,482.00","$1,748,134,200.00"
Shrek 2,"$70,000,000","$371,226,247.00","$867,008,132.00"
Star Wars Ep. I: The Phantom Menace,"$115,000,000","$359,544,677.00","$912,044,677.00"
Beauty and the Beast,"$20,000,000","$356,057,266.00","$588,431,132.00"
The Dark Knight,"$185,000,000","$348,720,947.00","$816,996,207.00"
The Passion of the Christ,"$25,000,000","$345,782,930.00","$597,341,924.00"
Beauty and the Beast,"$160,000,000","$344,014,165.00","$1,099,199,706.00"
The Lion King,"$79,300,000","$342,485,283.00","$906,914,868.00"
Avatar,"$425,000,000","$335,507,625.00","$2,351,345,279.00"
Jurassic Park,"$63,000,000","$332,708,305.00","$975,812,584.00"
Rogue One: A Star Wars Story,"$200,000,000","$332,177,324.00","$849,102,856.00"
The Hunger Games,"$80,000,000","$328,010,692.00","$597,923,379.00"